spring-ws-core/src/test/resources/org/springframework/ws/soap/addressing/10/request-fault-to.xml

<S:Envelope xmlns:S="https://www.w3.org/2003/05/soap-envelope" xmlns:wsa="https://www.w3.org/2005/08/addressing">
    <S:Header>
        <wsa:MessageID>https://example.com/someuniquestring</wsa:MessageID>
        <wsa:ReplyTo>
            <wsa:Address>https://example.com/business/client1</wsa:Address>
        </wsa:ReplyTo>
        <wsa:FaultTo>
            <wsa:Address>https://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
        </wsa:FaultTo>
        <wsa:To>mailto:fabrikam@example.com</wsa:To>
        <wsa:Action>https://example.com/fabrikam/mail/Delete</wsa:Action>
    </S:Header>
    <S:Body>
        <f:Delete xmlns:f="https://example.com/fabrikam">
            <maxCount>42</maxCount>
        </f:Delete>
    </S:Body>
</S:Envelope>
